; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v11)
             (pred_10 ?v7 ?v12)
             (pred_1 ?v4 ?v12)
             (pred_4 ?v2 ?v4 )
	     (pred_2 ?v4)
             (pred_3 ?v9)
             (pred_6 ?v7)
             (pred_7 ?v12)
             (pred_5 ?v4)
             (pred_9 ?v7)
             (pred_12 ?v4)
             (pred_8 ))



(:action op_1
:parameters (?v8 ?v13 ?v10 ?v6)
:precondition (and (pred_3 ?v8) (pred_3 ?v13) (pred_6 ?v10) (pred_7 ?v6)
          (pred_11 ?v8 ?v13) (pred_10 ?v10 ?v6)
                   (pred_1 ?v13 ?v6) (pred_2 ?v8) 
                   (pred_5 ?v13) (pred_9 ?v10))
:effect (and  (pred_12 ?v13) (not (pred_5 ?v13))))


(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_3 ?v8) (pred_3 ?v3)
               (pred_2 ?v8) (pred_11 ?v8 ?v3) (pred_12 ?v3))
:effect (and (pred_2 ?v3) (not (pred_2 ?v8))))

(:action op_3
:parameters (?v8 ?v10)
:precondition (and (pred_3 ?v8) (pred_6 ?v10) 
                  (pred_2 ?v8) (pred_4 ?v10 ?v8) (pred_8 ))
:effect (and (pred_9 ?v10)
   (not (pred_4 ?v10 ?v8)) (not (pred_8 ))))


(:action op_2
:parameters (?v8 ?v1 ?v5)
:precondition (and (pred_3 ?v8) (pred_6 ?v1) (pred_6 ?v5)
                  (pred_2 ?v8) (pred_9 ?v5) (pred_4 ?v1 ?v8))
:effect (and (pred_9 ?v1) (pred_4 ?v5 ?v8)
        (not (pred_9 ?v5)) (not (pred_4 ?v1 ?v8))))

(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_3 ?v8) (pred_6 ?v10) 
                  (pred_2 ?v8) (pred_9 ?v10))
:effect (and (pred_8 ) (pred_4 ?v10 ?v8) (not (pred_9 ?v10)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_21 obj_07 obj_15 obj_24 obj_05 obj_08 obj_29 obj_16 obj_17 obj_01 obj_02 obj_32 obj_10 obj_23 obj_14 obj_20 obj_28 obj_12 obj_13 obj_30 obj_27 obj_26 obj_11 obj_06 obj_18
    obj_04 obj_19 obj_22
    obj_31 obj_03 obj_25 obj_09
    )

    (:init
       (pred_8)

       (pred_3 obj_21)
       (pred_3 obj_07)
       (pred_3 obj_15)
       (pred_3 obj_24)
       (pred_3 obj_05)
       (pred_3 obj_08)
       (pred_3 obj_29)
       (pred_3 obj_16)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_02)
       (pred_3 obj_32)
       (pred_3 obj_10)
       (pred_3 obj_23)
       (pred_3 obj_14)
       (pred_3 obj_20)
       (pred_3 obj_28)
       (pred_3 obj_12)
       (pred_3 obj_13)
       (pred_3 obj_30)
       (pred_3 obj_27)
       (pred_3 obj_26)
       (pred_3 obj_11)
       (pred_3 obj_06)
       (pred_3 obj_18)
       (pred_7 obj_04)
       (pred_7 obj_19)
       (pred_7 obj_22)
       (pred_6 obj_31)
       (pred_6 obj_03)
       (pred_6 obj_25)
       (pred_6 obj_09)

       (pred_11 obj_21 obj_08)
       (pred_11 obj_21 obj_07)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_07 obj_15)
       (pred_11 obj_07 obj_21)
       (pred_11 obj_15 obj_16)
       (pred_11 obj_15 obj_24)
       (pred_11 obj_15 obj_07)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_24 obj_05)
       (pred_11 obj_24 obj_15)
       (pred_11 obj_05 obj_01)
       (pred_11 obj_05 obj_24)
       (pred_11 obj_08 obj_02)
       (pred_11 obj_08 obj_29)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_29 obj_32)
       (pred_11 obj_29 obj_16)
       (pred_11 obj_29 obj_07)
       (pred_11 obj_29 obj_08)
       (pred_11 obj_16 obj_10)
       (pred_11 obj_16 obj_17)
       (pred_11 obj_16 obj_15)
       (pred_11 obj_16 obj_29)
       (pred_11 obj_17 obj_23)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_16)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_05)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_02 obj_20)
       (pred_11 obj_02 obj_32)
       (pred_11 obj_02 obj_08)
       (pred_11 obj_32 obj_28)
       (pred_11 obj_32 obj_10)
       (pred_11 obj_32 obj_29)
       (pred_11 obj_32 obj_02)
       (pred_11 obj_10 obj_12)
       (pred_11 obj_10 obj_23)
       (pred_11 obj_10 obj_16)
       (pred_11 obj_10 obj_32)
       (pred_11 obj_23 obj_13)
       (pred_11 obj_23 obj_14)
       (pred_11 obj_23 obj_17)
       (pred_11 obj_23 obj_10)
       (pred_11 obj_14 obj_30)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_23)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_28)
       (pred_11 obj_20 obj_02)
       (pred_11 obj_28 obj_26)
       (pred_11 obj_28 obj_12)
       (pred_11 obj_28 obj_32)
       (pred_11 obj_28 obj_20)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_10)
       (pred_11 obj_12 obj_28)
       (pred_11 obj_13 obj_06)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_13 obj_23)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_30 obj_18)
       (pred_11 obj_30 obj_14)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_27 obj_26)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_26 obj_11)
       (pred_11 obj_26 obj_28)
       (pred_11 obj_26 obj_27)
       (pred_11 obj_11 obj_06)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_26)
       (pred_11 obj_06 obj_18)
       (pred_11 obj_06 obj_13)
       (pred_11 obj_06 obj_11)
       (pred_11 obj_18 obj_30)
       (pred_11 obj_18 obj_06)
       (pred_5 obj_23)
       (pred_5 obj_32)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_1  obj_23 obj_04)
       (pred_1  obj_32 obj_19)
       (pred_1  obj_15 obj_22)
       (pred_1  obj_14 obj_19)
       (pred_12 obj_21)
       (pred_12 obj_07)
       (pred_12 obj_24)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_29)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_01)
       (pred_12 obj_02)
       (pred_12 obj_10)
       (pred_12 obj_20)
       (pred_12 obj_28)
       (pred_12 obj_12)
       (pred_12 obj_13)
       (pred_12 obj_30)
       (pred_12 obj_27)
       (pred_12 obj_26)
       (pred_12 obj_11)
       (pred_12 obj_06)
       (pred_12 obj_18)

       (pred_10  obj_31 obj_04)
       (pred_10  obj_03 obj_19)
       (pred_10  obj_25 obj_22)
       (pred_10  obj_09 obj_19)
       (pred_4 obj_31 obj_02)
       (pred_4 obj_03 obj_14)
       (pred_4 obj_25 obj_10)
       (pred_4 obj_09 obj_11)
       (pred_2 obj_17)
    )

    (:goal (and
       (pred_4 obj_31 obj_24)
       (pred_4 obj_25 obj_06)
       (pred_4 obj_09 obj_08)
    ))
(:constraints
  (always (not (pred_2 obj_12)))
)
)

; plan
1. (op_5 obj_17 obj_16)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_16)
   goals met: 0 of 3
2. (op_5 obj_16 obj_10)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_10)
   goals met: 0 of 3
3. (op_3 obj_10 obj_25)
   deleted: (pred_4 obj_25 obj_10) (pred_8)
   added: (pred_9 obj_25)
   goals met: 0 of 3
4. (op_5 obj_10 obj_16)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_16)
   goals met: 0 of 3
5. (op_5 obj_16 obj_29)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_29)
   goals met: 0 of 3
6. (op_5 obj_29 obj_08)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_08)
   goals met: 0 of 3
7. (op_5 obj_08 obj_02)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_02)
   goals met: 0 of 3
8. (op_2 obj_02 obj_31 obj_25)
   deleted: (pred_9 obj_25) (pred_4 obj_31 obj_02)
   added: (pred_9 obj_31) (pred_4 obj_25 obj_02)
   goals met: 0 of 3
9. (op_5 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 0 of 3
10. (op_4 obj_08 obj_31)
   deleted: (pred_9 obj_31)
   added: (pred_8) (pred_4 obj_31 obj_08)
   goals met: 0 of 3
11. (op_5 obj_08 obj_02)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_02)
   goals met: 0 of 3
12. (op_3 obj_02 obj_25)
   deleted: (pred_4 obj_25 obj_02) (pred_8)
   added: (pred_9 obj_25)
   goals met: 0 of 3
13. (op_5 obj_02 obj_08)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_08)
   goals met: 0 of 3
14. (op_2 obj_08 obj_31 obj_25)
   deleted: (pred_9 obj_25) (pred_4 obj_31 obj_08)
   added: (pred_9 obj_31) (pred_4 obj_25 obj_08)
   goals met: 0 of 3
15. (op_5 obj_08 obj_29)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_29)
   goals met: 0 of 3
16. (op_5 obj_29 obj_16)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_16)
   goals met: 0 of 3
17. (op_5 obj_16 obj_17)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_17)
   goals met: 0 of 3
18. (op_1 obj_17 obj_23 obj_31 obj_04)
   deleted: (pred_5 obj_23)
   added: (pred_12 obj_23)
   goals met: 0 of 3
19. (op_5 obj_17 obj_23)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_23)
   goals met: 0 of 3
20. (op_5 obj_23 obj_13)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_13)
   goals met: 0 of 3
21. (op_5 obj_13 obj_06)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_06)
   goals met: 0 of 3
22. (op_4 obj_06 obj_31)
   deleted: (pred_9 obj_31)
   added: (pred_8) (pred_4 obj_31 obj_06)
   goals met: 0 of 3
23. (op_5 obj_06 obj_11)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_11)
   goals met: 0 of 3
24. (op_3 obj_11 obj_09)
   deleted: (pred_4 obj_09 obj_11) (pred_8)
   added: (pred_9 obj_09)
   goals met: 0 of 3
25. (op_5 obj_11 obj_06)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_06)
   goals met: 0 of 3
26. (op_5 obj_06 obj_13)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_13)
   goals met: 0 of 3
27. (op_5 obj_13 obj_23)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_23)
   goals met: 0 of 3
28. (op_5 obj_23 obj_17)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_17)
   goals met: 0 of 3
29. (op_5 obj_17 obj_16)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_16)
   goals met: 0 of 3
30. (op_5 obj_16 obj_29)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_29)
   goals met: 0 of 3
31. (op_5 obj_29 obj_08)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_08)
   goals met: 0 of 3
32. (op_2 obj_08 obj_25 obj_09)
   deleted: (pred_9 obj_09) (pred_4 obj_25 obj_08)
   added: (pred_9 obj_25) (pred_4 obj_09 obj_08)
   goals met: 1 of 3
33. (op_5 obj_08 obj_29)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_29)
   goals met: 1 of 3
34. (op_5 obj_29 obj_16)
   deleted: (pred_2 obj_29)
   added: (pred_2 obj_16)
   goals met: 1 of 3
35. (op_5 obj_16 obj_17)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_17)
   goals met: 1 of 3
36. (op_5 obj_17 obj_24)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_24)
   goals met: 1 of 3
37. (op_4 obj_24 obj_25)
   deleted: (pred_9 obj_25)
   added: (pred_8) (pred_4 obj_25 obj_24)
   goals met: 1 of 3
38. (op_5 obj_24 obj_17)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_17)
   goals met: 1 of 3
39. (op_5 obj_17 obj_23)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_23)
   goals met: 1 of 3
40. (op_5 obj_23 obj_13)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_13)
   goals met: 1 of 3
41. (op_5 obj_13 obj_06)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_06)
   goals met: 1 of 3
42. (op_3 obj_06 obj_31)
   deleted: (pred_4 obj_31 obj_06) (pred_8)
   added: (pred_9 obj_31)
   goals met: 1 of 3
43. (op_5 obj_06 obj_13)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_13)
   goals met: 1 of 3
44. (op_5 obj_13 obj_23)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_23)
   goals met: 1 of 3
45. (op_5 obj_23 obj_17)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_17)
   goals met: 1 of 3
46. (op_5 obj_17 obj_24)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_24)
   goals met: 1 of 3
47. (op_2 obj_24 obj_25 obj_31)
   deleted: (pred_9 obj_31) (pred_4 obj_25 obj_24)
   added: (pred_9 obj_25) (pred_4 obj_31 obj_24)
   goals met: 2 of 3
48. (op_5 obj_24 obj_17)
   deleted: (pred_2 obj_24)
   added: (pred_2 obj_17)
   goals met: 2 of 3
49. (op_5 obj_17 obj_23)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_23)
   goals met: 2 of 3
50. (op_5 obj_23 obj_13)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_13)
   goals met: 2 of 3
51. (op_5 obj_13 obj_06)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_06)
   goals met: 2 of 3
52. (op_4 obj_06 obj_25)
   deleted: (pred_9 obj_25)
   added: (pred_8) (pred_4 obj_25 obj_06)
   goals met: 3 of 3
